arduino/ArduinoCore-arc32/boards.txt


intel_edu_x.name=Intel® EDU
intel_edu_x.vid.0=0x2341
intel_edu_x.pid.0=0x003e
intel_edu_x.vid.1=0x2A03
intel_edu_x.pid.1=0x003e
intel_edu_x.vid.0x2A03.warning=Uncertified
intel_edu_x.upload.tool=eduload
intel_edu_x.upload.protocol=script
intel_edu_x.upload.maximum_size=196608
intel_edu_x.upload.use_1200bps_touch=falase
intel_edu_x.upload.wait_for_upload_port=false
intel_edu_x.upload.native_usb=false
intel_edu_x.upload.params.quiet=-q
intel_edu_x.upload.params.verbose=-q
intel_edu_x.build.usb_product="Arduino Due"
intel_edu_x.build.mcu=ARCv2EM
intel_edu_x.build.board=ARC32_TOOLS
intel_edu_x.build.core=arduino
intel_edu_x.build.ldscript=linker_scripts/flash.ld
intel_edu_x.build.variant=intel_edu_x
intel_edu_x.build.variant_system_lib=arc32drv_edu
intel_edu_x.build.vid=0x2341
intel_edu_x.build.pid=0x003e

# See: http://code.google.com/p/arduino/wiki/Platforms


